# Terraform environment at23
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.appsettings.data.azurerm_client_config.hub: Reading...
data.azurerm_private_dns_zone.postgres: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.appsettings.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_private_dns_zone.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_resource_group.spoke: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
data.azurerm_subnet.default: Reading...
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.key_vault.data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_user_assigned_identity.admin: Reading...
module.rbac.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.postgres_server.data.azurerm_client_config.current: Reading...
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.postgres: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
data.azurerm_subnet.default: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001at23/subnets/Default]
module.rbac.data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23]
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
data.azurerm_subnet.postgres: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001at23/subnets/Postgres]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23]
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001at23]
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001at23]
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at23]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at23]
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at23]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at23"
      + name                    = "db-psqlsrvaltinnauthregister001at23-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at23"
      + name                    = "db-psqlsrvaltinnauthregister001at23-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "7655029494720324333" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ts" = "2025-03-03T22:20:39Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:AppConnectionString_at23-register"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "key_vault_reference" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:AppConnectionString?label=at23-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001at23.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001at23-register-app" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:MigrationConnectionString_at23-register"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "key_vault_reference" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:MigrationConnectionString?label=at23-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001at23.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001at23-register-migrator" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "postgres_server" {
      ~ administrator_password        = (sensitive value)
      ~ fqdn                          = "psqlsrvaltinnauthregister001at23.postgres.database.azure.com" -> (known after apply)
      ~ geo_redundant_backup_enabled  = true -> false # forces replacement
      ~ id                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001at23" -> (known after apply)
        name                          = "psqlsrvaltinnauthregister001at23"
      - tags                          = {} -> null
      - zone                          = "1" -> null
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server_configuration.configuration["azure.extensions"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "configuration" {
      ~ id        = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001at23/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001at23" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgres_server.azurerm_private_dns_a_record.hex[0] will be destroyed
  # (because azurerm_private_dns_a_record.hex is not in configuration)
  - resource "azurerm_private_dns_a_record" "hex" {
      - fqdn                = "d02fb112c6b2.privatelink.postgres.database.azure.com." -> null
      - id                  = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.Network/privateDnsZones/d02fb112c6b2.privatelink.postgres.database.azure.com/A/@" -> null
      - name                = "@" -> null
      - records             = [
          - "10.202.96.4",
        ] -> null
      - resource_group_name = "rgaltinnauthregister001at23" -> null
      - tags                = {} -> null
      - ttl                 = 3600 -> null
      - zone_name           = "d02fb112c6b2.privatelink.postgres.database.azure.com" -> null
    }

  # module.postgres_server.azurerm_private_dns_zone.hex[0] will be destroyed
  # (because azurerm_private_dns_zone.hex is not in configuration)
  - resource "azurerm_private_dns_zone" "hex" {
      - id                                                    = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.Network/privateDnsZones/d02fb112c6b2.privatelink.postgres.database.azure.com" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "d02fb112c6b2.privatelink.postgres.database.azure.com" -> null
      - number_of_record_sets                                 = 2 -> null
      - resource_group_name                                   = "rgaltinnauthregister001at23" -> null
      - tags                                                  = {} -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "d02fb112c6b2.privatelink.postgres.database.azure.com." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.postgres_server.random_password.pass must be replaced
-/+ resource "random_password" "pass" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "trigger" = "2025-03-03T22:19:32Z" -> (known after apply)
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.postgres_server.time_sleep.wait_30_seconds will be destroyed
  # (because time_sleep.wait_30_seconds is not in configuration)
  - resource "time_sleep" "wait_30_seconds" {
      - create_duration = "30s" -> null
      - id              = "2025-03-03T21:23:13Z" -> null
    }

Plan: 4 to add, 2 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @howieandersen |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at23/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at23_altinn.register.tfstate.tfplan`